{
    "1": {
        "title": "The Blues Brothers",
        "logline": "xxHERONAMExx, just out from prison, puts together his old band to save the Catholic home where he and brother Elwood were raised.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ]
    },
    "2": {
        "title": "Hot Fuzz",
        "logline": "xxHEROPROFESSIONxx xxHERONAMExx is involuntarily transferred to a quaint English village and paired with a witless new partner. While on the beat, Nicholas suspects a sinister conspiracy is afoot with the residents.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : "Exceptional London cop"
    },
    "3": {
        "title": "Kingsman",
        "logline": "A spy organization recruits an unrefined, but promising street kid into the agency's ultra-competitive training program, just as a global threat emerges from a twisted tech genius",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "4": {
        "title": "Kick-Ass",
        "logline": "an unnoticed high school student and comic book fan who one day decides to become a super-hero, even though he has no powers, training or meaningful reason to do so.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "5": {
        "title": "It's a Mad, Mad, Mad, Mad World",
        "logline": "The dying words of a thief spark a madcap cross-country rush to find some treasure.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "6": {
        "title": "Midnight Run",
        "logline": "An accountant is chased by bounty hunters, the FBI, and the Mafia after jumping bail",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "7": {
        "title": "The Man from U.N.C.L.E.",
        "logline": "In the early 1960s, CIA agent xxHERONAMExx and KGB operative Illya Kuryakin participate in a joint mission against a mysterious criminal organization, which is working to proliferate nuclear weapons.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "8": {
        "title": "Back to the Future",
        "logline": "Enjoying a peaceable existence in 1885, Doctor Emmet Brown is about to be killed by Buford 'Mad Dog' Tannen. Marty McFly travels back in time to save his friend.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "9": {
        "title": "The Italian Job",
        "logline": "Comic caper movie about a plan to steal a gold shipment from the streets of Turin by creating a traffic jam.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "10": {
        "title": "The Three Musketeers",
        "logline": "A young swordsman comes to Paris and faces villains, romance, adventure and intrigue with three Musketeer friends.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "11": {
        "title": "Beverly Hills Cop",
        "logline": "A freewheeling Detroit cop pursuing a murder investigation finds himself dealing with the very different culture of Beverly Hills.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "12": {
        "title": "Big Trouble in Little China",
        "logline": "An All-American trucker gets dragged into a centuries-old mystical battle in Chinatown.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "13": {
        "title": "The Great Race",
        "logline": "When a popular daredevil proposes an automobile race across three continents, his arch rival vows to beat him, while an ambitious female reporter has her own plans for victory.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "14": {
        "title": "True Lies",
        "logline": "A fearless, globe-trotting, terrorist-battling secret agent has his life turned upside down when he discovers his wife might be having an affair with a used car salesman.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "15": {
        "title": "21 Jump Street",
        "logline": "A pair of underachieving cops are sent back to a local high school to blend in and bring down a synthetic drug ring.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "16": {
        "title": "Three Kings",
        "logline": "In the aftermath of the Persian Gulf War, 4 soldiers set out to steal gold that was stolen from Kuwait, but they discover people who desperately need their help.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "17": {
        "title": "RED",
        "logline": "When his peaceful life is threatened by a high-tech assassin, former black-ops agent xxHERONAMExx reassembles his old team in a last ditch effort to survive and uncover his assailants.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "18": {
        "title": "Pineapple Express",
        "logline": "A process server and his marijuana dealer wind up on the run from hitmen and a corrupt police officer after he witness his dealer's boss murder a competitor while trying to serve papers on him.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "19": {
        "title": "Tropic Thunder",
        "logline": "Through a series of freak occurrences, a group of actors shooting a big-budget war movie are forced to become the soldiers they are portraying.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "20": {
        "title": "Stripes",
        "logline": "Two friends who are dissatisfied with their jobs decide to join the army for a bit of fun.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "21": {
        "title": "The Last Boy Scout",
        "logline": "A down and out cynical detective teams up with a down and out ex-quarterback to try and solve a murder...",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "22": {
        "title": "Romancing the Stone",
        "logline": "A romance writer sets off to Colombia to ransom her kidnapped sister, and soon finds herself in the middle of a dangerous adventure.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : ""
    },
    "23": {
        "title": "48 Hrs.",
        "logline": "A hard-nosed xxHEROPROFESSIONxx reluctantly teams up with a wise-cracking criminal temporarily paroled to him, in order to track down a killer.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : "cop"
    },
    "24": {
        "title": "Smokey and the Bandit",
        "logline": "xxHERONAMExx is hired on to run a tractor trailer full of beer over county lines in hot pursuit by a pesky sheriff.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : "truck driver"
    },
    "25": {
        "title": "Bad Boys",
        "logline": "Two xxHEROPROFESSIONxxs protect a murder witness while investigating a case of stolen heroin",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : "hip detective"
    },
    "26": {
        "title": "The A-Team",
        "logline": "A group of xxHEROPROFESSIONxxs looks to clear their name with the U.S. military, who suspect the four men of committing a crime for which they were framed.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : "Iraq War veteran"
    },
    "27": {
        "title": "Innerspace",
        "logline": "A hapless xxHEROPROFESSIONxx must foil criminals to save the life of the man who, miniaturized in a secret experiment, was accidentally injected into him.",
        "genres": [
            "comedy",
            "action comedy",
            "action"
        ], 
        "xxHEROPROFESSIONxx" : "store clerk"
    }
}